import 'package:ossetia/CultureDisplay/models.dart';

List<CultureModel> cultureList = [
  CultureModel(
    name: 'Уа́стырджи (осет. Уастырджи)',
    about: 'Является покровителем мужчин, путников и воинов',
    description: '''
         Важнейший дзуар в традиционной религии осетин, один из героев Нартского эпоса. В нартском эпосе Уастырджи описывается как небожитель, и изображается седобородым мужчиной на белом коне, одетым в белую бурку. Спускаясь на землю, он проверяет людей, чтобы узнать, помогают ли они друг другу в нужде и горе.
         Уастырджи поддерживает хорошие отношения с нартами,
         с которыми он участвует в их походах за добычей и в пиршествах.
         Уастырджи является посредником между Богом и людьми,
         среди людей появляется в виде нищего старика.
         Для женщин его имя находится под запретом, 
         они называют его иносказательно Лагты Дзуар (Покровитель мужчин). 
         Уастырджи посвящены многочисленные святилища, находящиеся в Осетии. 
         Ежегодно во второй половине ноября в Осетии широко отмечается праздник, 
         посвящённый Уастырджи.Считается врагом воров, мошенников, убийц,
         клятвопреступников, покровителем честных и добрых людей.''',
  ),
  CultureModel(
      name: 'Хуца́у (осет. Хуыцау)',
      about: 'В осетинской мифологии единый, великий Бог — творец мироздания.',
      description: '''
        Все божества нартского эпоса и осетинской мифологии — дзуары 
        — подчиняются Хуцау, который внимательно следит за всем происходящим на земле.
        Живя на небе, Хуцау знает всё, что происходит на земле. 
        Обо всех бедах и проблемах людей ему сообщают особые сверхъестественные существа 
        — зэды, дауаги, а также Уастырджи, являющийся посредником между небом и землёй, 
        и которого Хуцау больше всего любит среди всех небожителей. 
        В осетинском нартском эпосе в спорах и битвах между нартами и небожителями, 
        Хуцау часто принимает сторону небожителей. Хуцау является одним из убийц нарта Батрадза. 
        Однажды небожители пожаловались на Батрадза. Хуцау наслал на Батрадза Хур ("солнце") и тот погиб. 
        С именем Хуцау связано появление трёх осетинских святилищ — Реком, Мыкалгабырта и Таранджелоз, 
        которые возникли на месте, куда упали три слезы Хуцау, которые он пролил по поводу убитого им Батрадза.
        Однажды нарты по совету Сырдона перестроили двери в своих домах, сделав их более высокими, 
        чтобы, входя в дом, не наклоняться, и, тем самым, не давать повода думать Хуцау, 
        что они поклоняются ему. Нарты также призвали Хуцау сойти с небес и помериться силой с ними. 
        Хуцау увидел, что нарты возомнили себя равным ему и проклял нартов за их гордыню. 
        В конце концов, Хуцау погубил нартов, поставив их перед единственным выбором избрать 
        вечную жизнь или вечную славу. Отказавшись от вечной жизни ради вечной славы, 
        нарты обрекли себя на исчезновение с лица земли. После проклятия 
        Хуцау нарты сколько бы ни обмолачивали зёрна, не могли собрать больше одного мешка. 
        Прожив год, нарты умерли от голода.'''),
];
